Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/ВидыПередачиИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПередачиИК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаСторону</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаПоДоговоруАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаПоДоговоруБезвмозмездногоПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/ChartsOfAccounts/ЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>ЕПСБУ</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДетализацииКОСГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляКазенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляБюджетных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтономных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьНеУказыватьПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоКПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоКЭК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетНеУчитываемых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Config/CommonModules/УправлениеМатериальнымиЗапасамиПечать/Ext/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Движения документов при передаче пользование контрагенту.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ДвиженияДокументовПриПередачеВПользованиеКонтрагентуЗабаланс(МассивОбъектов) Экспорт
	Запрос = Новый Запрос;
	ЧастиЗапроса = Новый Массив; // Массив из Строка
	ЧастиЗапроса.Добавить(ТекстЗапросаДвиженияПриПередачеВПользованиеКонтрагентуЗабаланс());
	ЧастиЗапроса.Добавить(ТекстЗапросаСоответствиеСчетовПередачиВПользованиеКонтрагентуЗабаланс());
	НомерЗапроса = 1;
	ПараметрыРаспределения = Новый Массив; // Массив из Структура
	ДокументыПоТипам = ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов);
	Для Каждого Документ Из ДокументыПоТипам Цикл
		Если Не ЕстьФункцияТекстЗапросаПриПередачеВПользованиеКонтрагентуЗабаланс(Документ.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ.Значение[0]);
		//@skip-check dynamic-access-method-not-found
		ТекстЗапросаПоВидуДокумента = МенеджерДокумента.ТекстЗапросаТаблицыДляРасчетаДвиженийПриПередачеВПользованиеКонтрагентуЗабаланс(); // Строка
		ЧастиЗапроса.Добавить(
			СтрЗаменить(ТекстЗапросаПоВидуДокумента,
				"&МассивОбъектов",
				"&МассивОбъектов" + НомерЗапроса));
		Запрос.УстановитьПараметр("МассивОбъектов" + НомерЗапроса, Документ.Значение);
		//@skip-check dynamic-access-method-not-found
		//@skip-check invocation-parameter-type-intersect
		ПараметрыРаспределения.Добавить(МенеджерДокумента.ПараметрыРаспределенияЗабалансовыхДвижений());
		НомерЗапроса = НомерЗапроса + 1;
	КонецЦикла;
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	ПроверятьСуммыРезервов = РезервированиеНФА.ИспользуетсяРезервированиеСумм();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ПроверятьСуммыРезервов", ПроверятьСуммыРезервов);
	СчетаПередачи = Новый Массив; // Массив из ПланСчетовСсылка.ЕПСБУ
	Счет25 = БухгалтерскийУчет.СчетПоКоду("25");
	Если ЗначениеЗаполнено(Счет25) Тогда
		СчетаПередачи.Добавить(Счет25);
	КонецЕсли;
	Счет26 = БухгалтерскийУчет.СчетПоКоду("26");
	Если ЗначениеЗаполнено(Счет26) Тогда
		СчетаПередачи.Добавить(Счет26);
	КонецЕсли;
	Запрос.УстановитьПараметр("СчетаПередачи", СчетаПередачи);
	СчетаМЗ = Новый Массив; // Массив из ПланСчетовСсылка.ЕПСБУ
	Счет10856 = БухгалтерскийУчет.СчетПоКоду("108.56");
	Если ЗначениеЗаполнено(Счет10856) Тогда
		СчетаМЗ.Добавить(Счет10856);
	КонецЕсли;
	Счет10857 = БухгалтерскийУчет.СчетПоКоду("108.57");
	Если ЗначениеЗаполнено(Счет10857) Тогда
		СчетаМЗ.Добавить(Счет10857);
	КонецЕсли;
	Запрос.УстановитьПараметр("СчетаМЗ", СчетаМЗ);
	Запрос.УстановитьПараметр("СчетУчета", БухгалтерскийУчет.СчетПоКоду("108.56"));
	Запрос.УстановитьПараметр("ВалютаРубль", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("Передача25", Перечисления.ВидыПередачиИК.ПередачаПоДоговоруАренды);
	Запрос.УстановитьПараметр("Передача26", Перечисления.ВидыПередачиИК.ПередачаПоДоговоруБезвмозмездногоПользования);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаДвиженийЗаб = РезультатЗапроса[0].Выгрузить();
	
	ТаблицаРезультат = ТаблицаДвиженийЗаб.СкопироватьКолонки();
	ИндексПервогоЗапросаДокумента = 4;
	ИндексТипаДокумента = 0;
	Отбор = Новый Структура("Ссылка", Неопределено);	
	Для Каждого Документ Из ДокументыПоТипам Цикл
	
		ПараметрыРаспределенияДвиженийЗаб = ПараметрыРаспределения[ИндексТипаДокумента];
		
		ВыборкаДокумент = РезультатЗапроса[ИндексПервогоЗапросаДокумента + ИндексТипаДокумента].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДокумент.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Отбор, ВыборкаДокумент);
			ТаблицаДвиженийДокументаЗаб = ТаблицаДвиженийЗаб.Скопировать(Отбор);
			ЗаполнитьЗначенияСвойств(ПараметрыРаспределенияДвиженийЗаб, ВыборкаДокумент,
				"Организация, ИФО, Дата");
			ПараметрыРаспределенияДвиженийЗаб.ВыборкаМатериалы = ВыборкаДокумент.Выбрать();
			ПараметрыРаспределенияДвиженийЗаб.ТаблицаДвижений = ТаблицаДвиженийДокументаЗаб;
			УправлениеПечатьюБГУ.СопоставитьДвиженияСоСтрокамиТабличнойЧасти(ПараметрыРаспределенияДвиженийЗаб);
			Для Каждого Строка Из ТаблицаДвиженийДокументаЗаб Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаРезультат.Добавить(), Строка);	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьФункцияТекстЗапросаПриПередачеВПользованиеКонтрагентуЗабаланс(Ключ)
	Возврат Ключ = Тип("ДокументСсылка.НакладнаяНаОтпускИК");
КонецФункции

Функция ТекстЗапросаСоответствиеСчетовПередачиВПользованиеКонтрагентуЗабаланс()
	Возврат
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 1, 2) = ""25""
	|			ТОГДА &Передача25
	|		КОГДА ПОДСТРОКА(ЕПСБУ.Код, 1, 2) = ""26""
	|			ТОГДА &Передача26
	|	КОНЕЦ КАК ВидПередачи,
	|	ПОДСТРОКА(ЕПСБУ.Код, 4, 1) КАК ПодКод,
	|	ЕПСБУ.УчетПоКПС КАК УчетПоКПС,
	|	ЕПСБУ.УчетПоКЭК КАК УчетПоКЭК
	|ПОМЕСТИТЬ СчетаПередачи
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО ЕПСБУВидыСубконто.Ссылка = ЕПСБУ.Ссылка
	|			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура))
	|ГДЕ
	|	ЕПСБУ.Ссылка В ИЕРАРХИИ(&СчетаПередачи)
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ПОДСТРОКА(ЕПСБУ.Код, 5, 1) КАК ПодКод
	|ПОМЕСТИТЬ СчетаУчета
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО ЕПСБУВидыСубконто.Ссылка = ЕПСБУ.Ссылка
	|			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура))
	|ГДЕ
	|	ЕПСБУ.Ссылка В ИЕРАРХИИ(&СчетаМЗ)
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаУчета.Ссылка КАК СчетУчета,
	|	СчетаПередачи.Ссылка КАК СчетПередачи,
	|	СчетаПередачи.ВидПередачи КАК ВидПередачи,
	|	СчетаПередачи.УчетПоКПС КАК УчетПоКПС,
	|	СчетаПередачи.УчетПоКЭК КАК УчетПоКЭК
	|ПОМЕСТИТЬ СоответствиеСчетов
	|ИЗ
	|	СчетаУчета КАК СчетаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаПередачи КАК СчетаПередачи
	|		ПО (СчетаПередачи.ПодКод = СчетаУчета.ПодКод)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетУчета,
	|	ВидПередачи";
	
КонецФункции

Функция ТекстЗапросаДвиженияПриПередачеВПользованиеКонтрагентуЗабаланс()
	Возврат
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.НакладнаяНаОтпускИК) КАК Ссылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.Номенклатура)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатураСсылка,
	|	ВЫБОР
	|		КОГДА НЕ ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО))
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1
	|		КОГДА НЕ ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО))
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2
	|		КОГДА НЕ ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО))
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК ДопСубконто,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт КАК Количество,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма КАК Сумма,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт КАК КоличествоОстаток,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма КАК СуммаОстаток,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПССсылка,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭКСсылка,
	|	0 КАК НомерСтрокиДокумента
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&МассивОбъектов)
	|				И СчетКт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|				И (ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|					ИЛИ ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|					ИЛИ ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|ГДЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт > 0";
	
КонецФункции


#КонецОбласти
